lkolbly/cmsis-svd/data/Cypress/MB9B560R.svd
        <!-- REGISTER "IF2ARB2" -->
        <register>
          <name>IF2ARB2</name>
          <description>IF2 Arbitration Registers 2</description>
          <addressOffset>0x4A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MSGVAL" -->
            <field>
              <name>MSGVAL</name>
              <description>MsgVal</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "XTD" -->
            <field>
              <name>XTD</name>
              <description>Xtd</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DIR" -->
            <field>
              <name>DIR</name>
              <description>Dir</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID28" -->
            <field>
              <name>ID28</name>
              <description>ID28</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID27" -->
            <field>
              <name>ID27</name>
              <description>ID27</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID26" -->
            <field>
              <name>ID26</name>
              <description>ID26</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID25" -->
            <field>
              <name>ID25</name>
              <description>ID25</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID24" -->
            <field>
              <name>ID24</name>
              <description>ID24</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID23" -->
            <field>
              <name>ID23</name>
              <description>ID23</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID22" -->
            <field>
              <name>ID22</name>
              <description>ID22</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID21" -->
            <field>
              <name>ID21</name>
              <description>ID21</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID20" -->
            <field>
              <name>ID20</name>
              <description>ID20</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID19" -->
            <field>
              <name>ID19</name>
              <description>ID19</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID18" -->
            <field>
              <name>ID18</name>
              <description>ID18</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID17" -->
            <field>
              <name>ID17</name>
              <description>ID17</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID16" -->
            <field>
              <name>ID16</name>
              <description>ID16</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF2MCTR" -->
        <register>
          <name>IF2MCTR</name>
          <description>IF2 Message Control Register</description>
          <addressOffset>0x4C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFF8F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "NEWDAT" -->
            <field>
              <name>NEWDAT</name>
              <description>NewDat</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSGLST" -->
            <field>
              <name>MSGLST</name>
              <description>MsgLst</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTPND" -->
            <field>
              <name>INTPND</name>
              <description>IntPnd</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UMASK" -->
            <field>
              <name>UMASK</name>
              <description>UMask</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXIE" -->
            <field>
              <name>TXIE</name>
              <description>TxIE</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RXIE" -->
            <field>
              <name>RXIE</name>
              <description>RxIE</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RMTEN" -->
            <field>
              <name>RMTEN</name>
              <description>RmtEn</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXRQST" -->
            <field>
              <name>TXRQST</name>
              <description>TxRqst</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EOB" -->
            <field>
              <name>EOB</name>
              <description>EoB</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DLC" -->
            <field>
              <name>DLC</name>
              <description>DLC</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF2DTA1_L" -->
        <register>
          <name>IF2DTA1_L</name>
          <description>IF2 Data Registers A1</description>
          <addressOffset>0x50</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DATA_1_" -->
            <field>
              <name>DATA_1_</name>
              <description>Data(1)</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA_0_" -->
            <field>
              <name>DATA_0_</name>
              <description>Data(0)</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF2DTA2_L" -->
        <register>
          <name>IF2DTA2_L</name>
          <description>IF2 Data Registers A2</description>
          <addressOffset>0x52</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DATA_3_" -->
            <field>
              <name>DATA_3_</name>
              <description>Data(3)</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA_2_" -->
            <field>
              <name>DATA_2_</name>
              <description>Data(2)</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF2DTB1_L" -->
        <register>
          <name>IF2DTB1_L</name>
          <description>IF2 Data Registers B1</description>
          <addressOffset>0x54</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DATA_5_" -->
            <field>
              <name>DATA_5_</name>
              <description>Data(5)</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA_4_" -->
            <field>
              <name>DATA_4_</name>
              <description>Data(4)</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
